In [12]:
import pandas as pd

In [13]:
df = pd.read_csv('data2.csv')
df

    Age  Experience  Rank Nationality   Go
0    36          10     9          UK   NO
1    42          12     4         USA   NO
2    23           4     6           N   NO
3    52           4     4         USA   NO
4    43          21     8         USA  YES
5    44          14     5          UK   NO
6    66           3     7           N  YES
7    35          14     9          UK  YES
8    52          13     7           N  YES
9    35           5     9           N  YES
10   24           3     5         USA   NO
11   18           3     7          UK  YES
12   45           9     9          UK  YES

In [14]:
df['Age']

0     36
1     42
2     23
3     52
4     43
5     44
6     66
7     35
8     52
9     35
10    24
11    18
12    45
Name: Age, dtype: int64

In [15]:
df[['Age', 'Rank']]

    Age  Rank
0    36     9
1    42     4
2    23     6
3    52     4
4    43     8
5    44     5
6    66     7
7    35     9
8    52     7
9    35     9
10   24     5
11   18     7
12   45     9

In [16]:
df[4:6]

   Age  Experience  Rank Nationality   Go
4   43          21     8         USA  YES
5   44          14     5          UK   NO

In [17]:
df.iloc[4:6, [1,3,4]]

   Experience Nationality   Go
4          21         USA  YES
5          14          UK   NO

In [18]:
df.loc[4:6, 'Rank':'Go']

   Rank Nationality   Go
4     8         USA  YES
5     5          UK   NO
6     7           N  YES

In [19]:
(df['Experience'] > 12) & (df['Go'] == 'YES')

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7      True
8      True
9     False
10    False
11    False
12    False
dtype: bool

In [20]:
df[(df['Experience'] > 12) & (df['Go'] == 'YES')]

   Age  Experience  Rank Nationality   Go
4   43          21     8         USA  YES
7   35          14     9          UK  YES
8   52          13     7           N  YES

In [21]:
(df['Nationality'] == 'N')

0     False
1     False
2      True
3     False
4     False
5     False
6      True
7     False
8      True
9      True
10    False
11    False
12    False
Name: Nationality, dtype: bool

In [22]:
df[(df['Nationality'] == 'N')]

   Age  Experience  Rank Nationality   Go
2   23           4     6           N   NO
6   66           3     7           N  YES
8   52          13     7           N  YES
9   35           5     9           N  YES

In [23]:
df.query("Nationality == 'N'")

   Age  Experience  Rank Nationality   Go
2   23           4     6           N   NO
6   66           3     7           N  YES
8   52          13     7           N  YES
9   35           5     9           N  YES